ERezeptClientSimpleExample/ERezeptClientSimpleExample/Connected Services/AuthSignatureService/AuthSignatureService.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:GERROR="http://ws.gematik.de/tel/error/v2.0" xmlns:SIGW="http://ws.gematik.de/conn/AuthSignatureService/WSDL/v7.4" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:CCTX="http://ws.gematik.de/conn/ConnectorContext/v2.0" xmlns:SIG="http://ws.gematik.de/conn/SignatureService/v7.4" targetNamespace="http://ws.gematik.de/conn/AuthSignatureService/WSDL/v7.4" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <documentation>
		Copyright (c) 2016, gematik - Gesellschaft für Telematikanwendungen der Gesundheitskarte mbH. Alle Rechte vorbehalten.
		Beschreibung: Konnektor Signatur Basisanwendung Authentifizierung
		version=7.4.0 
	</documentation>
  <types>
    <xs:schema>
      <xs:import schemaLocation="SignatureService.xsd" namespace="http://ws.gematik.de/conn/SignatureService/v7.4" />
      <xs:import schemaLocation="ConnectorContext.xsd" namespace="http://ws.gematik.de/conn/ConnectorContext/v2.0" />
      <xs:import schemaLocation="../tel/error/TelematikError.xsd" namespace="http://ws.gematik.de/tel/error/v2.0" />
    </xs:schema>
  </types>
  <message name="ExternalAuthenticateRequestMessage">
    <part name="parameter" element="SIG:ExternalAuthenticate" />
  </message>
  <message name="ExternalAuthenticateResponseMessage">
    <part name="parameter" element="SIG:ExternalAuthenticateResponse" />
  </message>
  <message name="FaultMessage">
    <part name="parameter" element="GERROR:Error" />
  </message>
  <portType name="AuthSignatureServicePortType">
    <operation name="ExternalAuthenticate">
      <input message="SIGW:ExternalAuthenticateRequestMessage" />
      <output message="SIGW:ExternalAuthenticateResponseMessage" />
      <fault name="FaultMessage" message="SIGW:FaultMessage" />
    </operation>
  </portType>
  <binding name="AuthSignatureServiceBinding" type="SIGW:AuthSignatureServicePortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="ExternalAuthenticate">
      <soap:operation soapAction="http://ws.gematik.de/conn/SignatureService/v7.4#ExternalAuthenticate" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
      <fault name="FaultMessage">
        <soap:fault use="literal" name="FaultMessage" namespace="" />
      </fault>
    </operation>
  </binding>
  <service name="AuthSignatureService">
    <port name="AuthSignatureServicePort" binding="SIGW:AuthSignatureServiceBinding">
      <soap:address location="http://ti-konnektor/authsignatureservice" />
    </port>
  </service>
</definitions>